# coding utf-8
class WineFilter
  #single
  def countries
    @countries ||= {
      '中国' => '中国',
      '美国' => '美国',
      '英国' => '英国',
      '法国' => '法国',
      '德国' => '德国',
      '智利' => '智利',
      '意大利' => '意大利',
      '俄罗斯' => '俄罗斯',
      '西班牙' => '西班牙',
      '澳洲' => '澳大利亚',
      '澳大利亚' => '澳大利亚',
      '南非' => '南非',
      '阿根廷' => '阿根廷',
      '新西兰' => '新西兰',
      '葡萄牙' => '葡萄牙',
      '加拿大' => '加拿大',
      '希腊' => '希腊',
      '奥地利' => '奥地利',
      '匈牙利' => '匈牙利',
      '韩国' => '韩国',
      '日本' => '日本',
      '墨西哥' => '墨西哥',
    }
  end

  def countries_keys_regexp
    @countries_keys_regexp ||= Regexp.new(countries.keys.join('|'), Regexp::IGNORECASE | Regexp::MULTILINE)
  end

  def brands
    @brands ||={
      '拉菲' => '拉菲',
      '干露' => '干露',
      '奔富洛神' => '奔富洛神',
      '百家得' => '百家得',
      '芝华士' => '芝华士',
      '马爹利' => '马爹利',
      'Martell' => '马爹利',
      '火地岛' => '火地岛',
      '桃乐丝' => '桃乐丝',
      '杰卡斯' => '杰卡斯',
      'baileys' => '百利',
      '百利' => '百利',
      'Remy Martin' => '人头马',
      '人头马' => '人头马',
      '贝马格雷' => '贝马格雷',
      '尊尼获加' => '尊尼获加',
      'JOHNNIE WALKER' => '尊尼获加',
      'GREY GOOSE' => '灰雁',
      '灰雁' => '灰雁',
      'Cointreau' => '君度',
      '君度' => '君度',
      'skyy' => '深蓝',
      '蓝天' => '深蓝',
      '深蓝' => '深蓝',
      'GORDON\'S' => '歌顿',
      '歌顿' => '歌顿',
      'HENNESSY' => '轩尼诗',
      '轩尼诗' => '轩尼诗',
      '温莎' => '温莎',
      'Windsor' => '温莎',
      '杰克丹尼' => '杰克丹尼',
      'JACK DANIELS' => '杰克丹尼',
      '斯米诺' => '斯米诺',
      'smirnoff' => '斯米诺',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #'' => '',
      #。。。
    }
  end

  def brands_keys_regexp
    @brands_keys_regexp ||= Regexp.new(brands.keys.join('|'), Regexp::IGNORECASE | Regexp::MULTILINE)
  end

  #multi
  def types
    @types ||= {
      #葡萄酒
      '红酒' => '红葡萄酒',
      '干红' => '红葡萄酒',
      '红葡萄酒' => '红葡萄酒',
      '白葡萄酒' => '白葡萄酒',
      '干白' => '白葡萄酒',
      '桃红葡萄酒' => '桃红酒',
      '桃红酒' => '桃红酒',
      '桃红' => '桃红酒',
      #'起泡酒' => '起泡酒',
      '起泡' => '起泡酒',
      #'加强葡萄酒' => '加强葡萄酒',

      '冰酒' => '冰酒',
      '贵腐酒' => '贵腐酒',
      '贵腐甜白' => '贵腐酒',

      #洋酒
      '洋酒' => '洋酒',
      #'烈酒' => '烈酒',
      
      #白酒
      '白酒' => '白酒',

      #黄酒
      '黄酒' => '黄酒',

      #啤酒
      '啤酒' => '啤酒',

      #组合
      '组合' => '组合',
      '套装' => '组合',

      #other
      '酒具' => '酒具',
      #'礼盒' => '礼盒', 算到酒具里面
    }
  end

  #葡萄品种
  def grape_types
    @grape_types ||=
      {
      #全是葡萄酒？
      '赤霞珠' => '赤霞珠',
      #'卡本内苏维翁' => '赤霞珠',
      #'卡本内·苏维翁' => '赤霞珠',
      '苏维翁' => '赤霞珠',
      'Cabernet Sauvignon' => '赤霞珠',
      'Sauvignon' => '赤霞珠',

      '设拉子' => '西拉',
      '席拉' => '西拉',
      '西拉' => '西拉',
      'Syrah' => '西拉',

      '梅乐' => '梅洛',
      '梅洛' => '梅洛',
      '米勒' => '梅洛',
      '梅鹿辄' => '梅洛',
      'Merlot' => '梅洛',

      '黑皮诺' => '黑皮诺',
      '黑比诺' => '黑皮诺',
      '黑品诺' => '黑皮诺',
      'Pinot Noir' => '黑皮诺',

      '歌海娜' => '歌海娜',
      '格那希' => '歌海娜',
      '格连纳什' => '歌海娜',
      'Grenache' => '歌海娜',

      '品丽珠' => '品丽珠',
      #'卡本内·弗朗' => '品丽珠',
      #'卡本内弗朗' => '品丽珠',
      '弗朗' => '品丽珠',
      'Cabernet Franc' => '品丽珠',

      '雷司令' => '雷司令',
      '霞多丽' => '霞多丽',
      '长相思' => '长相思',
      '佳美娜' => '佳美娜',
      '佳丽酿' => '佳丽酿',
      '佳美' => '佳美',
      '马尔贝克' => '马尔贝克',
      '白诗南' => '白诗南',
      '赛美蓉' => '赛美蓉',
      '丹魄' => '丹魄',
      '小维多' => '小维多',
      '麝香葡萄' => '麝香葡萄',
      '琼瑶浆' => '琼瑶浆',
      '桑娇维塞' => '桑娇维塞',
      '品乐塔吉' => '品乐塔吉',
      '白比诺' => '白比诺',
      '灰比诺' => '灰比诺',
      '神索' => '神索',
      '仙粉黛' => '仙粉黛',
      '内比奥罗' => '内比奥罗',
      '巴比拉' => '巴比拉',
      '维欧尼' => '维欧尼',
      '白玉霓' => '白玉霓',
      '蛇龙珠' => '蛇龙珠',
      '宝石解百纳' => '宝石解百纳',
      '黑达沃拉' => '黑达沃拉',
      '多姿桃' => '多姿桃',
      '龙眼' => '龙眼',
      '维奥娜' => '维奥娜',
      '希尔瓦那' => '希尔瓦那',
      '贵人香' => '贵人香',
    }
  end
end
